[
{"info": "<p>Vietnam is one of our favourite countries, packed with history, stunning landscapes, cultural highlights and amazing food. It’s one of the most exciting destinations in South East Asia.<br>We visited back in 1999 for the first time and recently we headed back there to create this Vietnam Travel Blog section for you. We had the luxury of time and 2 x 3 month visas to really get to know Vietnam and share it with you.</p>"},
{"info": "<p>In this post we’ll look at places to go in Vietnam, itinerary ideas, where to stay and how to travel in Vietnam. Links here will take you to more detailed posts. We hope you find our Vietnam tips and guides useful in planning your travel, vacation or holiday in Vietnam.</p>"},
{"info": "<p>A Short Vietnam video giving you a taste of what Vietnam is like.</p>"},
{"section": "<h3><span id=\"Have_You_Heard_Vietnam_is_Difficult_or_the_Vietnamese_Unpleasant\">Have You Heard Vietnam is Difficult or the Vietnamese Unpleasant?</span></h3>"},
{"info": "<p>The Vietnamese can be some of the nicest, friendliest, kindest and happiest people you could meet. They’re charming without being pushy, helpful, lovers of children and just genuinely nice. Of course there are some bad apples and most of the bad stories involve taxi driver scams, but in all our time in Vietnam we’ve seen only good.</p>"},
{"info": "<p>You need some travel smarts as you do in any country where haggling over prices is just the normal way to do things. Smile, try to use some Vietnamese and don’t be obnoxious. The Vietnamese are good people. See what happened <a href=\"https://worldtravelfamily.com/living-in-hoi-an-slow-travel-family-digital-nomad/\" rel=\"\">when I fell off my bike in Hoi An </a>if you need further proof.</p>"},
{"section": "<h3><span id=\"Traffic_and_Roads_in_Vietnam\">Traffic and Roads in Vietnam</span></h3>"},
{"info": "<p>Because speed limits are low and roads are largely populated by push bikes and scooters, we feel safer on the roads in Vietnam than we have done so far in any Asian country.</p>"},
{"info": "<p>Cities are busy but we cycle with our kids every day in Hoi An.</p>"},
{"info": "<p>Crossing the road is an adventure, nobody is going to stop, you just get used to picking your time and weaving between moving vehicles. Just yesterday I watched two little girls on their way to school, at 5 years old they know how it’s done and their parents trust they’ll be safe solo.</p>"},
{"info": "<p>Just watch out for taxis and buses, they can be unpredictable.</p>"},
{"info": "<p>Nobody on a bike has a death wish, they’re all trying to get home to their families safely but saying that, road death rates are high in Vietnam.</p>"},
{"info": "<p>Use common sense and don’t hire scooters unless you have a suitable international motorbike license and adequate <a href=\"https://worldtravelfamily.com/travel-insurance-extended-open-ended-travel/\" rel=\"\">insurance</a>.</p>"},
{"section": "<h3><span id=\"Highlights_of_Vietnam\">Highlights of Vietnam</span></h3>"},
{"info": "<p>Vietnam has at least 8 <a href=\"https://whc.unesco.org/en/list/1133\">UNESCO</a> listed sites, including Ha Long Bay, Hue’s historic sites, the old town of Hoi An and the Champa complex at My Son sanctuary (above).</p>"},
{"section": "<h3><span id=\"Destinations_in_Vietnam\">Destinations in Vietnam</span></h3>"},
{"info": "<p>There are a million places to visit in Vietnam and I can’t possibly put them all on this page. Let’s just start here with a few popular destinations. For more detail you’ll have to find the dedicated post on this site. Just follow the links or use the search box at the top of our sidebar. A new addition and one that we highly recommend is <a href=\"https://worldtravelfamily.com/phong-nha-ke-bang-vietnam-national-park-and-caves/\">Phong Nha National Park and caves</a> in Central Vietnam.</p>"},
{"subsection": "<h4><span id=\"Saigon_Ho_Chi_Minh\">Saigon  ( Ho Chi Minh)</span></h4>"},
{"info": "<p>Saigon refers to the inner city area of Ho Chi Minh City. Renamed after the war in honor of the North Vietnamese leader. The area that most people end up in is District 1 where you will find backpacker accommodation and agencies selling tours and transportation to just about anywhere in Vietnam.</p>"},
{"info": "<p>One of the best tours from Saigon would be to the <a href=\"https://worldtravelfamily.com/cu-chi-tunnels-tour-cao-dai-temple-saigon-review-get-your-guide/\" rel=\"\">Chu Chi tunnels</a> which are located about 50 km west. This tour can include a Cau Dai temple visit, this religion is unique to Vietnam and was founded in 1912.</p>"},
{"info": "<p>The biggest draw card in Saigon itself is the War Remnants Museum and the Old Palace build by the South Vietnamese rulers but not used since tanks drove through its gates in 1975 to officially end the war.</p>"},
{"info": "<p><a href=\"https://worldtravelfamily.com/things-to-do-in-saigon-ho-chi-minh-vietnam/\" rel=\"\">Saigon</a> also boasts French Period architecture, abundant great food and fascinating markets.</p>"},
{"info": "<p>To book your Cu Chi Tunnels tour in advance ( recommended), check <a href=\"https://www.getyourguide.com/ho-chi-minh-city-l272/half-day-cu-chi-tunnels-tour-t60689/?partner_id=AKSIJ2F\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">here</a> . To Book Cu Chi, with the additional Cau Dai Temple Tour, look <a href=\"https://www.getyourguide.com/ho-chi-minh-city-l272/one-day-exploration-of-cao-dai-temple-cu-chi-tunnels-t69151/?partner_id=AKSIJ2F\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">here</a>.</p>"},
{"subsection": "<h4><span id=\"Hoi_An\">Hoi An</span></h4>"},
{"info": "<p>We’ve been <a href=\"https://worldtravelfamily.com/living-in-hoi-an-slow-travel-family-digital-nomad/\" rel=\"\">living in Hoi An</a> for a few months now and we’re pleased with our choice. This incredibly picturesque riverside city is something of a tourist hot spot these days, combing the charms of the Old Town with its ancient buildings, tailor’s shops and <a href=\"https://worldtravelfamily.com/hoi-an-market-shopping/\" rel=\"\">Hoi An central market</a> with nearby rice paddies and beaches.</p>"},
{"info": "<p><a href=\"https://worldtravelfamily.com/what-to-eat-in-hoi-an-and-where-best-food-hoi-an/\" rel=\"\">Hoi An food</a> is world-famous and central Vietnam is a big producer of quality sea food.</p>"},
{"info": "<p>Around town there are various places of interest to keep you busy, throw a pot at <a rel=\"\" href=\"https://worldtravelfamily.com/hoi-an-pottery-village-thanh-ha-vietnam/\">the pottery village</a>, take a free Vietnamese lesson or one of the many local eco tours. <a href=\"https://whc.unesco.org/en/list/949\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">My Son Sanctuary</a> and Marble Mountain are a short day trip from Hoi An and Hue is accessible by tour, bus or train.</p>"},
{"info": "<p>The nearest large city, Danang, is about 45 minutes away and is another beach-side tourist draw, popular with <a href=\"https://worldtravelfamily.com/hoi-an-with-kids-families/\" rel=\"\">family holiday-makers</a></p>"},
{"subsection": "<h4><span id=\"Hanoi\">Hanoi</span></h4>"},
{"info": "<p>” You haven’t experienced Vietnam until you’ve visited its noisy, vibrant capital city, <a href=\"https://www.ourbigfattraveladventure.com/2015/01/31/five-reasons-love-hanoi/\" rel=\"\">Hanoi</a>. Navigate the traffic-choked streets of the Old Quarter to discover crumbling colonial buildings, street vendors and traditional tubular shops.</p>"},
{"info": "<p>Hanoi is filled with historic buildings but don’t miss the ornate Temple of Literature, St Joseph’s Cathedral and the UNESCO listed Imperial Citadel of Thang Long.</p>"},
{"info": "<p>Learn about the country’s revolutionary leader at the Ho Chi Minh mausoleum and palace complex and take a stroll around Hoan Kiem Lake where locals come to exercise and relax.</p>"},
{"info": "<p>No trip to Hanoi would be complete without sampling its famous food delights such as a Banh Mi sandwich or the city’s signature dish, Bun Cha. Stop in at Café Giang for a Ca Phe Trung (egg coffee), they’ve been serving this traditional brew for over 70 years. “</p>"},
{"subsection": "<h4><span id=\"Ha_Long_Bay\">Ha Long Bay</span></h4>"},
{"info": "<p><span style=\"font-weight: 400;\">“If you are looking for a magical location in Vietnam, then you cannot go past Ha Long Bay in the north of the country.  </span></p>"},
{"info": "<p><span style=\"font-weight: 400;\">With emerald-green waters, limestone islands and mystical caves, all while touring on Junk Boats, Ha Long Bay draws travellers to her every day and is certainly one of our favourites in South East Asia. </span></p>"},
{"info": "<p><span style=\"font-weight: 400;\">From day tours through to tours that keep you entertained for 2 days 3 nights, we highly recommend the latter.</span></p>"},
{"info": "<p><span style=\"font-weight: 400;\"> Sleeping on a Junk Boat, while doing day visits to floating villages, taking rowing tours, and getting to jump off the boat into the cool refreshing water, is so relaxing and fun plus gives you a great insight to local living and seeing nature’s beauty up close. </span></p>"},
{"info": "<p><span style=\"font-weight: 400;\">No matter what your budget, we highly recommend you choose your junk boat tour wisely and spend a few extra dollars to get a better experience and higher quality boat. We have done three tours since 2008 and loved Signature Cruises. You can read all about our recent trip to Halong Bay  right here. “</span></p>"},
{"subsection": "<h4><span id=\"Sapa\">Sapa</span></h4>"},
{"info": "<p>“Home to Vietnam’s highest peak (Fan Si Pan, which soars 3143m above sea level) Sapa is a must-see destination for nature lovers. The people of Sapa started welcoming tourists as far back as the early 1900s, when French colonists used it to escape the searing heat of Vietnam’s lowlands. During the 1940s, Vietnamese independence fighters drove the French from the region and it wasn’t until a few decades ago that tourists started to return to Sapa.</p>"},
{"info": "<p>Within easy reach of Hanoi, by overnight bus or train, Sapa is now one of Vietnam’s most popular tourist destinations.</p>"},
{"info": "<p>In Sapa, the magnificent purple mountains sink away into deep valleys, where terraced rice paddies feed the imagination — and the local population. Many ethnic minorities, including the H’Mong, the Dao and the Dai, make their homes in small hidden villages among these hills. Be <a href=\"https://www.myfiveacres.com/travel-tips/mindful-travel-in-vietnam/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">mindful of travelling ethically in Vietnam</a> and in this delicate region.</p>"},
{"info": "<p>For tourists, the big draw is the chance to trek along Sapa’s stunning valleys and mountains. It makes an excellent antidote to the hectic pace of life in Hanoi and is still a great place to escape the heat. Taking a multi-day trek between village homestays will give you the chance to immerse yourself in a slower pace of life, stretch your legs on the mountain tracks, and indulge in shots of the locally-made rice wine. It burns a little as it goes down but is perfect way to loosen your muscles after a long day of walking!”</p>"},
{"section": "<h3><span id=\"Tours_in_Vietnam\">Tours in Vietnam</span></h3>"},
{"info": "<p>How do you want to visit Vietnam? There are heaps of options.</p>"},
{"subsection": "<h4><span id=\"Luxury_Tours_or_Packages\">Luxury Tours or Packages</span></h4>"},
{"info": "<p>We review hotels for one of Australia’s luxury travel package companies. They get incredible prices on some of the best luxury hotels around the world. We have the job of testing these hotels for them, it’s a tough job. If you’re interested visit the Luxury Escapes website.</p>"},
{"section": "<h3><span id=\"Vietnam_with_Kids_and_for_Families\">Vietnam with Kids and for Families</span></h3>"},
{"info": "<p>I often wonder why people write posts “this place with kids.” It’s expected of us a family travel bloggers I guess. Most places are pretty much the same with kids or without and you’ll find yourself staying in the same places and taking the same trips. Kids really aren’t a problem when you travel but we parents do worry about sickness, road safety and so on.</p>"},
{"info": "<p>So Vietnam with kids, what can I say? There are loads of interesting things for them to do like the pottery classes above, the Cu Chi tunnels tour or coconut boat rides and crab catching. There is much to learn about culture and history and Vietnamese food is generally lacking in spice or chili. You can also get just about any western food here, far more easily than in Thailand.</p>"},
{"info": "<p>Nobody in my family has had any sort of tummy trouble or diarrhoea in Vietnam but if you’re not used to tropical bugs you may want to read our post on <a href=\"https://worldtravelfamily.com/tips-avoiding-mosquitos/\" rel=\"\">how to avoid mosquitoes.</a></p>"},
{"info": "<p>There are plenty of accommodation options at all price points and likewise plenty of transportation options. There are beaches if that is your want. It’s as easy to take your kids to Vietnam as to any other country but be mindful of the weather and if you plan to use bikes bring your own helmets.</p>"},
{"info": "<p>I think I’ve seen more tourists with kids, babies and toddlers in Hoi An than I have in any other Asian destination, it’s a massively popular family holiday hot spot particularly for Australians. For that reason maybe avoid school holidays. We have a full post on <a href=\"https://worldtravelfamily.com/hoi-an-with-kids-families/\" rel=\"\">things to do in and around Hoi An for families, here,</a> with more with-kids posts planned.</p>"},
{"subsection": "<h4><span id=\"Small_Group_Tours_of_Vietnam\">Small Group Tours of Vietnam</span></h4>"},
{"info": "<p>All of the big adventure travel companies offer small group tours of Vietnam. We’re big fans of Explore Worldwide, my husband and I met on one of their tours decades ago.  </p>"},
{"subsection": "<h4><span id=\"Tours_and_Transportation_Within_Vietnam_Booking_Trains_Buses_and_Planes\">Tours and Transportation Within Vietnam. Booking Trains, Buses and Planes</span></h4>"},
{"info": "<p>Every town visited by tourists and backpackers has plenty of small travel agents’ shops selling tours and onward transportation. Everything is very easy to arrange on the ground but you’ll need time and your best haggling skills.</p>"},
{"info": "<p><strong>To book train or bus tickets online</strong> ( or even flights)in advance,  you can use 12GoAsia. This site has been around a long time and has been popular for Thailand for a very long time. <a href=\"https://12go.asia/?z=178835\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Visit 12GoAsia here</a>.</p>"},
{"info": "<p>If you’re short of time or need to book a tour in advance for a particular day, we recommend booking online. Read our <a href=\"https://worldtravelfamily.com/getyourguide-review-why-we-use-getyourguide/\" rel=\"\">Get Your Guide tours review</a> here.  </p>"},
{"section": "<h3><span id=\"Classes_and_Courses_to_Take\">Classes and Courses to Take</span></h3>"},
{"info": "<p>Cooking classes, pottery classes, Vietnamese lessons, yoga, painting and more.  </p>"},
{"section": "<h3><span id=\"Theatre_Dance_Music_from_Lune_at_3_Locations_in_Vietnam_and_Traditional_Vietnamese_Water_Puppets\">Theatre, Dance &amp; Music from Lune at 3 Locations in Vietnam and Traditional Vietnamese Water Puppets.</span></h3>"},
{"info": "<p>Something I have to add, because we saw a show in Hoi An and thought it was wonderful, are the Lune Theatre productions that you can catch in Saigon, Hanoi and now, new for 2018, in a purpose-built performance space in Hoi An.</p>"},
{"info": "<p>These shows are magical and beautiful, featuring traditional music and instruments, dance, drama and more. The show we saw in Hoi An, “The Mist” beautifully illustrates the life of rice farmers in the Mekong Delta. If you get a chance, go.</p>"},
{"info": "<p>You can book Lune tickets in advance for Hoi An <a href=\"https://www.getyourguide.com/hoi-an-l831/hoi-an-acrobatic-theatre-show-t142035/?partner_id=AKSIJ2F\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">here.</a> and for Saigon/Ho Chi Minh <a href=\"https://www.getyourguide.com/ho-chi-minh-city-l272/a-o-show-ho-chi-minh-city-t39856/?partner_id=AKSIJ2F\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">here.</a></p>"},
{"info": "<p>Find out more on Lune’s own website, <a href=\"https://www.luneproduction.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">here</a>. There are 4 different shows that rotate through Lune’s current 3 theatres in Vietnam.</p>"},
{"info": "<p>I’ll also mention Vietnamese water puppet shows. We’ve seen shows in Hanoi and Hoi An, great for kids and a lot of fun. These short performances are traditional and well worth seeing. Buy tickets to Saigon’s water puppet show <a href=\"https://www.getyourguide.com/ho-chi-minh-city-l272/water-puppet-show-in-ho-chi-minh-t120762/?partner_id=AKSIJ2F\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">here.</a></p>"},
{"section": "<h3><span id=\"Visas_for_Vietnam\">Visas for Vietnam</span></h3>"},
{"subsection": "<h4><span id=\"2_Week_E-Visa_3_Month_Multiple_Entry_and_More\">2 Week, E-Visa, 3 Month, Multiple Entry and More</span></h4>"},
{"info": "<p>Vietnam isn’t as easy as other countries in South East Asia when it comes to visas and it’s one of the more expensive countries to enter. You can’t just turn up at the borders empty-handed and expect a visa on arrival unless you’re on a two-week holiday. Vietnam requires a little forward planning for long-term travellers.  Please read the information below and do your own research for your country. We’re as current as we can be, but for Vietnam the regulations seem to change by the hour. You’ll find a search box below ( an affiliate) for what we think is a trustworthy visa company.</p>"},
{"info": "<p>Visitors to Vietnam can visit a Vietnamese embassy to buy their Visa, or arrange an e-visa approval online which they must then produce on arrival. We were all set to visit the <a href=\"https://www.vietnamembassy.org.uk/\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Vietnamese embassy in London</a> when we discovered that using a visa agency was actually cheaper and potentially easier. The embassy in London would charge $100 US for each 3 month visa. That was significantly more expensive than using the agency. We took the agency route ( letter of pre-approval) for our 3 month Vietnam visa and had no problems whatsoever on arrival in Vietnam as UK passport holders.</p>"},
{"info": "<p>The agencies don’t actually issue the visas but give you an authorization letter from the Vietnamese immigration department which allows you to receive a visa on arrival. Airlines are strict and won’t let you on the plane without either a full visa or authorization letter, ours was checked at Heathrow. You pay a small fee to the agency to get the letter emailed to you. The agency will apply for multiple travellers so when you get your letter don’t be surprised that it contains other people’s details such as name, date of birth and passport number. You can ask for a private letter with just your details for approximately $10 US more per person.</p>"},
{"info": "<p>The costs are normally between $20 and $25 US for the authorization letter. You then need to pay the stamping fee on arrival in Vietnam where the actual visa is stuck into your passport. This ranges from $20 for a single month to $25 for a three-month single entry visa. The multiple entry visas attract a higher stamping fee approximately $50 US. All the stamping fees need to be paid in cash in US $.</p>"},
{"info": "<p>The authorization letter only works if you are flying into an international airport. It will not work at land crossings. For that you’ll need to have a visa in your passport from an embassy or you will only be entitled to the free 15 day visa on arrival ( certain counties only)</p>"},
{"info": "<p>We’ve consulted with the visa company below ( <a href=\"https://joinsherpa.com/?aid=world_family\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">Sherpa</a>, they are based in Canada) and they had the following to say:</p>"},
{"info": "<p>Americans’ visa regulations for Vietnam are different again. Visa requirement change constantly, please double-check information with Sherpa or another reputable visa company.</p>"},
{"section": "<h3><span id=\"Food_in_Vietnam\">Food in Vietnam</span></h3>"},
{"info": "<p>You haven’t been to Vietnam until you’ve eaten a bowl of pho or mi quang perched on a tiny plastic stool at the roadside.</p>"},
{"info": "<p>The<a rel=\"\" href=\"https://worldtravelfamily.com/what-to-eat-in-hoi-an-and-where-best-food-hoi-an/\"> best food in Vietnam</a> comes from street stalls, it’s what the locals eat and will cost you about a dollar a bowl. Don’t expect a menu, these stalls specialise in one perfectly executed dish only be that <a href=\"https://worldtravelchef.com/mi-quang-noodles-vietnamese-food/\">mi quang</a>, <a href=\"https://worldtravelfamily.com/banh-xeo-eating-cooking-vietnam-crispy-pancakes/\">banh xeo</a> or <a href=\"https://worldtravelfamily.com/bun-bo-hue-food-hue-vietnam/\">bun bo Hue</a>.</p>"},
{"info": "<p>Vietnamese food isn’t challenging to western palates, it’s light and fresh with few spices. If you like your food hot you’ll find fresh and dried chilies on the table to add to taste.</p>"},
{"info": "<p>You’ll also find restaurants catering to tourists at every price point. None of us has had any tummy trouble at all in Vietnam and there are plenty of dishes to please children. Fresh, steamed and fried spring rolls are a favourite with my kids.</p>"},
{"info": "<p>You’ll find incredible fresh seafood in Central Vietnam with prawns costing little. Vegetarians, even vegans, are pretty well catered for in Vietnam too.</p>"},
{"section": "<h3><span id=\"Vaccinations_for_Vietnam_and_Health\">Vaccinations for Vietnam and Health</span></h3>"},
{"info": "<p>Of the 50+ countries we’ve been to I’m happy to say that Vietnam is in the group that gave us zero ilnesses or tummy trouble. None of us have had any travellers diarrhoea or sickness in over 6 months in Vietnam. We’ve eaten everything, at every street food stall and had no trouble at all. We’re hugely impressed with how clean things are here compared to some other parts of the world. There are few flies, and few mosquitos, there are plenty of rats.</p>"},
{"info": "<p>If you get sick in Vietnam it’s easy to pop along to a pharmacy, there’s one on almost every street and the pharmacists are very helpful and know their stuff. We’ve had to buy treatment for ringworm ( picked up by one of the kids in London), mouth ulcers and dressings for bike-related scrapes, it’s been no trouble at all.</p>"},
{"info": "<p>I would suggest carrying a basic first aid kit with you including:</p>"},
{"info": "<p>You can read more about our usual travel first aid kit here. The antibiotic powder Pises powder a US doctor put me onto this stuff, buy here) that I always pick up in Thailand was super useful for my cut, infected foot.</p>"},
{"info": "<p>We did not take any malaria prophylaxis for Vietnam ( 20 years ago we had to, these days it’s rare to need it anywhere). This is <a href=\"https://www.fitfortravel.nhs.uk/destinations/asia-east/vietnam/vietnam-malaria-map\" target=\"_blank\" rel=\"noopener noreferrer\">the malaria map for Vietnam</a>, most of Vietnam is low to no risk.</p>"},
{"info": "<p>Find suggested <a href=\"https://www.tmb.ie/destinations/vaccinations-for-viet-nam\" target=\"_blank\" rel=\"noopener noreferrer\">vaccinations for Vietnam here.</a></p>"},
{"section": "<h3><span id=\"Hotels_Hostels_Guest_Houses_Resorts_and_Apartments_Finding_Them\">Hotels, Hostels, Guest Houses, Resorts and Apartments. Finding Them</span></h3>"},
{"info": "<p>The first time we visited Vietnam it was very much a backpacker destination, these days there are plenty of up-market hotels and resorts on offer too and the tourists are flooding to Vietnam. People like us, the digital nomads and long term travellers are also here and there are amazing bargains to be had in long-term, quality accommodation.</p>"},
{"subsection": "<h4><span id=\"Finding_the_Best_Prices_and_Deals_on_Hotels_and_Resorts_in_Vietnam\">Finding the Best Prices and Deals on Hotels and Resorts in Vietnam</span></h4>"},
{"info": "<p>We highly recommend checking <a href=\"https://www.hotelscombined.com/?a_aid=124064\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Hotels Combined</a> if you’re serious about finding the best price for your stay, this booking engine compares multiple online booking engines to find you the best deal available. We also like to use <a href=\"https://www.agoda.com/partners/partnersearch.aspx?cid=1643033&amp;pcs=1\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Agoda</a> for Asia as they are the experts for the region and often have a bigger selection, particularly try them for smaller hotels and budget accommodation, they are not one of the booking engines Hotels Combined checks, so if you’re serious, check them too. If you’re the sort to book a long time in advance, maybe reserving multiple hotels on a fully refundable basis, <a href=\"https://www.booking.com/index.html?aid=848999\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Booking.com</a> is your friend.</p>"},
{"info": "<p>If you’re interested in <a href=\"https://www.booking.com/hotel/vn/sunrise-premium-resort-hoi-an.html?aid=848999&amp;no_rooms=1&amp;group_adults=1\" target=\"_blank\" rel=\"noreferrer noopener\" aria-label=\" (opens in a new tab)\">The Sunrise Resort, pictured above, check here for prices and further information</a>. This is one of the luxury hotels we’ve tested on behalf of Luxury Escapes, an Australian company specialising on incredibly good offers on top end hotel packages. Their special offer prices are way below what we paid for these hotels and the quality was superb.</p>"},
{"subsection": "<h4><span id=\"Hostels\">Hostels</span></h4>"},
{"info": "<p>You will find a big selection of hostels, some have private family rooms, on all of the above websites.</p>"},
{"subsection": "<h4><span id=\"Long_Term_Stays_House_and_Apartments\">Long Term Stays, House and Apartments</span></h4>"},
{"info": "<p>We’ve booked hotels in Hoi An and Hue through Airbnb, both were good, small boutique style hotels or homestays. A homestay can be a hotel, hostel or actual homestay in Vietnam. If you want to join AirBnb we can pass on some free credits ( about $40) if you use <a href=\"https://www.airbnb.com.au/c/alysonl429?currency=USD\">our link here</a>.</p>"},
{"info": "<p>We found our beautiful house for 2 months in Hoi An through a local expats Facebook group. We booked a cheap hotel for arrival and within half a day of posting in the expat group we’d found the perfect house for us at a great price. </p>"},
{"subsection": "<h4><span id=\"Your_Pinterest_Image\">Your Pinterest Image</span></h4>"},
{"info": "<p>Thanks for using our website, we make it to be useful to you, so if there’s any information you need, ask in the comments and we can add it to this Vietnam Travel Blog page. We’re still in Vietnam, we’re living in Hoi An for a while, so we can get you the on-the-ground information.</p>"}
]